# Лекция 6. Циклы

# 1
# fruits = ["яблоко", "банан", "вишня"]
# Напиши цикл for, который выведет каждый элемент списка в отдельной строке

fruits = ["яблоко", "банан", "вишня"]

for fruit in fruits:
    print(fruit)

# 2
# Напиши цикл for с использованием range(), чтобы вывести числа от 3 до 9 (включительно)

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]

for number in range(3,10):
    print(number)

# 3
# Напиши цикл while, который выводит числа от 5 до 1 в убывающем порядке (включительно)
# После достижения 1 программа должна вывести "Старт!"

